app/admin/dashboard.rb

SELECT "users".* FROM "users"
---
    end
    # Here is an example of a simple dashboard with columns and panels.
    #
    @users = User.all

SELECT COUNT(*) FROM "users"
---
      column do
        panel "Users" do
          ul do
            para "Total users: #{User.count}"

SELECT "kycs".* FROM "kycs" WHERE "kycs"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
              column :email
              column :created_at
              column "KYC Status", :status do |user|
                if user.kyc && user.kyc.status.present?