app/controllers/admin/kycs_controller.rb

SELECT "kycs".* FROM "kycs" WHERE "kycs"."id" = ? LIMIT ?  [["id", 94], ["LIMIT", 1]]
UPDATE "kycs" SET "updated_at" = ?, "status" = ? WHERE "kycs"."id" = ?  [["updated_at", "2023-04-21 00:52:37.317725"], ["status", "approved"], ["id", 91]]
---
    def update
        @kyc = Kyc.find(params[:id])
        if(session[:admin_authenticated])
          if @kyc.update(kyc_params)