app/controllers/admin/sessions_controller.rb

  def edit
    @kyc = Kyc.find(params[:id])
---
SELECT "kycs".* FROM "kycs" WHERE "kycs"."id" = ? LIMIT ?  [["id", 94], ["LIMIT", 1]]