app/views/balances/index.html.erb


<% if @wallet.cards.empty? %>
---
SELECT 1 AS one FROM "cards" WHERE "cards"."wallet_id" = ? LIMIT ?  [["wallet_id", 1], ["LIMIT", 1]]


<% if !@wallet.cards.empty? %>
---
SELECT 1 AS one FROM "cards" WHERE "cards"."wallet_id" = ? LIMIT ?  [["wallet_id", 1], ["LIMIT", 1]]