app/views/balances/new.html.erb

SELECT "cards".* FROM "cards" WHERE "cards"."wallet_id" = ?  [["wallet_id", 1]]
---
    <%= form.label :card_id %>
    <%= form.select :card_id, options_for_select(@wallet.cards.map{ |c| ["#{c.issuer} - #{c.number.slice(-4, 4)}", c.id] }), { class: "form-control" } %>