app/views/passwords/edit.html.erb

<%= form_with model: Current.user, url: edit_password_path, data: { turbo: false } do |form| %>
    <% if Current.user.errors.any? %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]