app/controllers/application_controller.rb

  def current_admin_user
    @current_admin_user ||= User.find_by(id: session[:admin_user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]