app/controllers/balances_controller.rb

  def edit
    @balance = @wallet.balances.find_by(id: params[:id])
---
SELECT "balances".* FROM "balances" WHERE "balances"."wallet_id" = ? AND "balances"."id" = ? LIMIT ?  [["wallet_id", 1], ["id", 1], ["LIMIT", 1]]

  def create
    @balances = @wallet.balances
    @cards = @wallet.cards
    if !@cards
      redirect_to wallet_cards_path, alert: "You need to add a card before adding cash"
    else
      if @balances.any? { |balance| balance.currency == balance_params[:currency] }
        redirect_to wallet_balances_path, notice: 'Currency already exist.'
      else
        @balance = @wallet.balances.new(balance_params)
        if @balance.save
---
SELECT "balances".* FROM "balances" WHERE "balances"."wallet_id" = ?  [["wallet_id", 3]]
INSERT INTO "balances" ("value", "wallet_id", "created_at", "updated_at", "currency") VALUES (?, ?, ?, ?, ?)  [["value", 100.0], ["wallet_id", 3], ["created_at", "2023-05-01 19:09:25.100589"], ["updated_at", "2023-05-01 19:09:25.100589"], ["currency", "USD"]]

  def update
    if !@balance
      redirect_to new_wallet_balance_path, alert: 'You do not have a currency, add one now!'
    elsif !@wallet.cards
      redirect_to wallet_cards_path, notice: "You need to add a card before adding cash"
    else
      if @balance && balance_params[:value].to_f < 9999
        @balance.increment(:value, balance_params[:value].to_f)
---
UPDATE "balances" SET "value" = ?, "updated_at" = ? WHERE "balances"."id" = ?  [["value", 200.0], ["updated_at", "2023-04-27 20:32:48.276159"], ["id", 1]]

  def destroy
    @balance = Balance.find(params[:id])
    @balance.destroy
---
SELECT "balances".* FROM "balances" WHERE "balances"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "balances" WHERE "balances"."id" = ?  [["id", 1]]

    def set_balance
      @balance = @wallet.balances.find_by(id: params[:id])
---
SELECT "balances".* FROM "balances" WHERE "balances"."wallet_id" = ? AND "balances"."id" = ? LIMIT ?  [["wallet_id", 1], ["id", 1], ["LIMIT", 1]]

    def require_kyc_exists
      @user = Current.user
      unless @user.kyc.present?
---
SELECT "kycs".* FROM "kycs" WHERE "kycs"."user_id" = ? LIMIT ?  [["user_id", 41], ["LIMIT", 1]]