app/controllers/cards_controller.rb

    def set_card
      @card = Current.user.cards.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 37], ["LIMIT", 1]]