app/controllers/cards_controller.rb

  def show
    @card = @wallet.cards.find_by(id: params[:id])
---
SELECT "cards".* FROM "cards" WHERE "cards"."wallet_id" = ? AND "cards"."id" = ? LIMIT ?  [["wallet_id", 3], ["id", 2], ["LIMIT", 1]]

  def create
    @card = @wallet.cards.new(card_params)
    if @card.save
---
INSERT INTO "cards" ("issuer", "holder_name", "number", "expiration_date", "cvv", "wallet_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @card = Card.find(params[:id])
    @card.destroy
---
SELECT "cards".* FROM "cards" WHERE "cards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "cards" WHERE "cards"."id" = ?  [["id", 1]]

    def set_card
      @card = @wallet.cards.find_by(id: params[:id])
---
SELECT "cards".* FROM "cards" WHERE "cards"."wallet_id" = ? AND "cards"."id" = ? LIMIT ?  [["wallet_id", 3], ["id", 2], ["LIMIT", 1]]

    def require_kyc_exists
      @user = Current.user
      unless @user.kyc.present?
---
SELECT "kycs".* FROM "kycs" WHERE "kycs"."user_id" = ? LIMIT ?  [["user_id", 40], ["LIMIT", 1]]