app/controllers/kyc_controller.rb

    def new
        @kyc = Kyc.find_by(user_id: Current.user.id)
        if @kyc.present?
            puts (@kyc.present?)
---
SELECT "kycs".* FROM "kycs" WHERE "kycs"."user_id" = ? LIMIT ?  [["user_id", 10], ["LIMIT", 1]]
SELECT 1 AS one FROM "kycs" WHERE "kycs"."user_id" = ? LIMIT ?  [["user_id", 11], ["LIMIT", 1]]
SELECT 1 AS one FROM "kycs" WHERE "kycs"."user_id" = ? LIMIT ?  [["user_id", 9], ["LIMIT", 1]]

    def create
        @kyc = Kyc.find_by(user_id: Current.user.id)
        if @kyc.present?
            redirect_to kyc_show_path(@kyc)
        else
            @kyc = Kyc.new(kyc_params)
            @kyc.user = Current.user
            if @kyc.save
                if @kyc.status == "pending"
                    @kyc.update(status: :awaiting)
---
SELECT "kycs".* FROM "kycs" WHERE "kycs"."user_id" = ? LIMIT ?  [["user_id", 10], ["LIMIT", 1]]
SELECT 1 AS one FROM "kycs" WHERE "kycs"."user_id" = ? AND "kycs"."id" != ? LIMIT ?  [["user_id", 10], ["id", 76], ["LIMIT", 1]]
UPDATE "kycs" SET "updated_at" = ?, "status" = ? WHERE "kycs"."id" = ?  [["updated_at", "2023-04-04 22:04:50.758290"], ["status", "awaiting"], ["id", 32]]
INSERT INTO "kycs" ("license_number", "user_id", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?)  [["license_number", nil], ["user_id", 11], ["created_at", "2023-04-05 02:21:24.157830"], ["updated_at", "2023-04-05 02:21:24.157830"], ["status", "pending"]]
UPDATE "kycs" SET "updated_at" = ?, "status" = ? WHERE "kycs"."id" = ?  [["updated_at", "2023-04-05 02:41:52.117228"], ["status", "awaiting"], ["id", 82]]

    def show
        @kyc = Kyc.find_by(user_id: Current.user.id)
---
SELECT "kycs".* FROM "kycs" WHERE "kycs"."user_id" = ? LIMIT ?  [["user_id", 10], ["LIMIT", 1]]