app/controllers/registrations_controller.rb

    def create
        @user=User.new(user_params)
        if User.email_registered?(@user.email)
            @user.errors.add(user_params[:email], " has already been registered")
            render :new
        elsif @user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at", "firstname", "lastname") VALUES (?, ?, ?, ?, ?, ?)  [["email", "swetha@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-03-23 20:49:23.339527"], ["updated_at", "2023-03-23 20:49:23.339527"], ["firstname", nil], ["lastname", nil]]