app/controllers/sessions_controller.rb

  def create
    user = User.find_by(email: params[:email])
    if user.present?
      if user.authenticate(params[:password])
        session[:user_id] = user.id
        if user.kyc.present?
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "calvin@gmail.com"], ["LIMIT", 1]]
SELECT "kycs".* FROM "kycs" WHERE "kycs"."user_id" = ? LIMIT ?  [["user_id", 40], ["LIMIT", 1]]

  def omniauth
    auth = request.env['omniauth.auth'][:info]
    user = User.find_by(email: auth[:email])
    random_password = SecureRandom.hex(10)

    if user
      session[:user_id] = user.id
      redirect_to root_path, notice: "Signed in! Please remember to change your password! "
    else
      new_user = User.new(
        email: auth[:email],
        firstname: auth[:first_name],
        lastname: auth[:last_name],
        password: random_password,
        password_confirmation: random_password
        )
      if new_user.save
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "keerthana.keetu.p@gmail.com"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at", "firstname", "lastname", "terms_of_service") VALUES (?, ?, ?, ?, ?, ?, ?)