app/controllers/terms_controller.rb

  def update
    @user = Current.user
    random_password = SecureRandom.hex(10)
    if @user.update(terms_of_service: term_params[:terms_of_service], password: random_password, password_confirmation: random_password)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ?, "terms_of_service" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$12$HmfsB7sujMrM/58sNRlrZOGhZNB7EsSyJnczvAo6Xacsw1DnV00hG"], ["updated_at", "2023-04-27 20:30:20.546665"], ["terms_of_service", 1], ["id", 37]]