app/controllers/transactions_controller.rb

    def index
        user = Current.user
        @transactions_sender=Transaction.where(sender_id: user.id).pluck(:amount, :receiver_email, :created_at, :currency)
        @transactions_receiver=Transaction.where(receiver_id: user.id).pluck(:amount, :sender_email, :created_at, :currency)
---
SELECT "transactions"."amount", "transactions"."receiver_email", "transactions"."created_at", "transactions"."currency" FROM "transactions" WHERE "transactions"."sender_id" = ?  [["sender_id", 42]]
SELECT "transactions"."amount", "transactions"."sender_email", "transactions"."created_at", "transactions"."currency" FROM "transactions" WHERE "transactions"."receiver_id" = ?  [["receiver_id", 42]]

    def create
        s_id=Current.user.id
        @receiver=User.find_by(email: params[:transaction][:email])
        if @receiver
            r_id=User.find_by(email: params[:transaction][:email]).id
            @transaction=Transaction.new(sender_id: s_id, receiver_id: r_id, amount: params[:transaction][:amount], receiver_email: params[:transaction][:email], sender_email: Current.user.email, currency: params[:transaction][:currency]   )
            @balances = @wallet.balances
            if @balances.any? { |balance| balance.currency == params[:transaction][:currency] }
                #puts("Currency already exist !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!")
                if @balances.any? { |balance| balance.currency == params[:transaction][:currency] && balance.value < params[:transaction][:amount].to_f }
                    #puts("Not sufficient balance -------------------------------------------------balance.value", @balances.find_by(currency: params[:transaction][:currency] )[:value])
                    redirect_to wallet_balances_path, alert: "You need to add sufficient balance for this currency first"
                else
                    @balance = @balances.find_by(currency: params[:transaction][:currency] )
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "swetha@gmail.com"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "polkampally@gmail.com"], ["LIMIT", 1]]
SELECT "balances".* FROM "balances" WHERE "balances"."wallet_id" = ?  [["wallet_id", 4]]
SELECT "balances".* FROM "balances" WHERE "balances"."wallet_id" = ? AND "balances"."currency" = ? LIMIT ?  [["wallet_id", 4], ["currency", "USD"], ["LIMIT", 1]]

                        end
                    end
                    @receiver_balances=@receiver_wallet.balances
                    @receiver_balance = @receiver_balances.find_by(currency: params[:transaction][:currency] )
                    if @receiver_balance.present?
                        puts "Receiver balance present"
                        if @receiver_balance.update(value: @receiver_balance.value +  params[:transaction][:amount].to_f)
                            puts "Successful"
                            if(new_val.abs < 0.01)
                                new_val=0.0
                                @balance.destroy
                                if  @transaction.save
---
SELECT "balances".* FROM "balances" WHERE "balances"."wallet_id" = ? AND "balances"."currency" = ? LIMIT ?  [["wallet_id", 3], ["currency", "USD"], ["LIMIT", 1]]
UPDATE "balances" SET "value" = ?, "updated_at" = ? WHERE "balances"."id" = ?  [["value", 200.0], ["updated_at", "2023-05-01 19:13:41.997158"], ["id", 1]]
DELETE FROM "balances" WHERE "balances"."id" = ?  [["id", 1]]
INSERT INTO "transactions" ("sender_id", "receiver_id", "amount", "created_at", "updated_at", "receiver_email", "sender_email", "currency") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

                                    flash[:alert] = "Transaction not updated. Coding error. Sorry for the incompetance!"
                                    render :new
                                end
                            elsif @balance.update(value: new_val.to_f)
                                if  @transaction.save
---
UPDATE "balances" SET "value" = ?, "updated_at" = ? WHERE "balances"."id" = ?  [["value", 100.0], ["updated_at", "2023-05-01 19:13:42.000925"], ["id", 2]]
INSERT INTO "transactions" ("sender_id", "receiver_id", "amount", "created_at", "updated_at", "receiver_email", "sender_email", "currency") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def require_kyc_exists
        @user = Current.user
        unless @user.kyc.present?
---
SELECT "kycs".* FROM "kycs" WHERE "kycs"."user_id" = ? LIMIT ?  [["user_id", 41], ["LIMIT", 1]]