app/controllers/wallets_controller.rb

INSERT INTO "wallets" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 43], ["created_at", "2023-05-01 19:07:22.750456"], ["updated_at", "2023-05-01 19:07:22.750456"]]
---
  def create
      @wallet = Wallet.new(user_id: @user.id)
      if @wallet.save

SELECT "kycs".* FROM "kycs" WHERE "kycs"."user_id" = ? LIMIT ?  [["user_id", 41], ["LIMIT", 1]]
---
    def require_kyc_exists
      @user = Current.user
      unless @user.kyc.present?