app/models/balance.rb

  def ensure_wallet_has_card
    unless wallet.cards.any?
---
SELECT 1 AS one FROM "cards" WHERE "cards"."wallet_id" = ? LIMIT ?  [["wallet_id", 1], ["LIMIT", 1]]